In [2]:
import pandas as pd
from pandas import Series,DataFrame

# 5.1　pandasのデータ構造

## series

In [5]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
'b' in obj2

True

In [17]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000,'utah':1540}
obj3 = pd.Series(sdata)
obj3

ohio      35000
texas     71000
oregon    16000
utah       1540
dtype: int64

In [21]:
states = {'ohio','texas','oregon','california'}
obj4 = pd.Series(sdata , index = states)
obj4

oregon        16000.0
texas         71000.0
ohio          35000.0
california        NaN
dtype: float64

In [23]:
pd.isnull(obj4)

oregon        False
texas         False
ohio          False
california     True
dtype: bool

In [24]:
pd.notnull(obj4)

oregon         True
texas          True
ohio           True
california    False
dtype: bool

In [25]:
obj3+obj4

california         NaN
ohio           70000.0
oregon         32000.0
texas         142000.0
utah               NaN
dtype: float64

## Dataframe

In [27]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
    'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
     }
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [30]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [36]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                           index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [37]:
#DataFrameの行列がSeriesとして表示される
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [38]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [42]:
import numpy as np
frame2['debt']=np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [44]:
#dekを使って、要らない列をデリートする
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Nevada  2.4   3.0    False
five   2002  Nevada  2.9   4.0    False
six    2003  Nevada  3.2   5.0    False

In [45]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [46]:
#嵌套辞書
pop={'Nevada':{2001:2.4,2002:2.9},
     'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [53]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [57]:
pd.DataFrame(pop, index = [2001,2002,2003],
            columns=['Nevada','Ohio'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [58]:
frame3.index.name='year';frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [59]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [60]:
#索引オブジェクト
obj = pd.Series(range(3),index=['a','b','c'])
index=obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [62]:
index[:-1]

Index(['a', 'b'], dtype='object')

indexは変更できない
pandasのindexは同じものを含めることができる

# 5.2基本機能
## インデックス再作成

In [67]:
obj = pd.Series([4.5,72,-53,36],index=['d','b','a','c'])
obj

d     4.5
b    72.0
a   -53.0
c    36.0
dtype: float64

In [68]:
obj2=obj.reindex(['d','b','a','c','e'])
obj2

d     4.5
b    72.0
a   -53.0
c    36.0
e     NaN
dtype: float64

In [69]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [71]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [72]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a','c','d'],
                     columns=['Ohio','Texas','Cali'])
frame

   Ohio  Texas  Cali
a     0      1     2
c     3      4     5
d     6      7     8

In [75]:
frame2 = frame.reindex(['a','c','d','e'])
frame2

   Ohio  Texas  Cali
a   0.0    1.0   2.0
c   3.0    4.0   5.0
d   6.0    7.0   8.0
e   NaN    NaN   NaN

In [76]:
states = {'ohio','texas','oregon','california'}
frame.reindex(columns=states)

   oregon  texas  ohio  california
a     NaN    NaN   NaN         NaN
c     NaN    NaN   NaN         NaN
d     NaN    NaN   NaN         NaN

## 指定された軸のアイテムを破棄する

In [77]:
obj

d     4.5
b    72.0
a   -53.0
c    36.0
dtype: float64

In [78]:
new_obj=obj.drop('c')
new_obj

d     4.5
b    72.0
a   -53.0
dtype: float64

In [80]:
#axis=1またはaxis='columns'が列の値をデリートする
frame3.drop('Ohio',axis=1)

state  Nevada
year
2000      NaN
2001      2.4
2002      2.9

## 索引、選択、フィルタリング

In [84]:
obj[1]

72.0

In [83]:
obj[2:4]

a   -53.0
c    36.0
dtype: float64

In [85]:
obj<2

d    False
b    False
a     True
c    False
dtype: bool

In [87]:
#locとilocを使って、選択する
frame2

   Ohio  Texas  Cali
a   0.0    1.0   2.0
c   3.0    4.0   5.0
d   6.0    7.0   8.0
e   NaN    NaN   NaN

In [92]:
frame2.loc['c',['Ohio','Cali']]

Ohio    3.0
Cali    5.0
Name: c, dtype: float64

In [95]:
frame2.iloc[2,[1,2]]

Texas    7.0
Cali     8.0
Name: d, dtype: float64

## 整数インデックス

In [97]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [98]:
ser2=pd.Series(np.arange(3.),index=['a','b','c'])
ser2[-1]

2.0

## 算術演算とデータ配置

In [102]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2=pd.Series([17.3,-32.5,23.44,11.5,0],index=['a','c','e','f','g'])
s1+s2

a    24.60
c   -35.00
d      NaN
e    24.94
f      NaN
g      NaN
dtype: float64

In [103]:
#算術方法に値を補充する
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df2.loc[1,'b']=np.nan
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [104]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [106]:
#dataframeとseriesの間に算術
arr=np.arange(12.).reshape((3,4))
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [109]:
#関数の応用とマッピング
f=lambda x:x.max()-x.min()
df1.apply(f)

a    8.0
b    8.0
c    8.0
d    8.0
dtype: float64

In [110]:
#浮動小数点値フォーマットを文字列に変換する
format= lambda x:'%.2f' % x
df1.applymap(format)

      a     b      c      d
0  0.00  1.00   2.00   3.00
1  4.00  5.00   6.00   7.00
2  8.00  9.00  10.00  11.00

In [111]:
df1['c'].map(format)

0     2.00
1     6.00
2    10.00
Name: c, dtype: object

In [112]:
#並べ替えとランキング
obj=pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [117]:
df1.sort_index(axis=0,ascending=False)

     a    b     c     d
2  8.0  9.0  10.0  11.0
1  4.0  5.0   6.0   7.0
0  0.0  1.0   2.0   3.0

In [118]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [128]:
df1['f']=np.nan
df1['f']=pd.Series([2.4,2.3,24,1,2],index=[0,1,3,'4',4])
df1

     a    b     c     d    f
0  0.0  1.0   2.0   3.0  2.4
1  4.0  5.0   6.0   7.0  2.3
2  8.0  9.0  10.0  11.0  NaN

In [131]:
df1.sort_index(axis=1,ascending=False)

     f     d     c    b    a
0  2.4   3.0   2.0  1.0  0.0
1  2.3   7.0   6.0  5.0  4.0
2  NaN  11.0  10.0  9.0  8.0

In [140]:
df1.sort_values(by=['a','f'])

     a    b     c     d    f
0  0.0  1.0   2.0   3.0  2.4
1  4.0  5.0   6.0   7.0  2.3
2  8.0  9.0  10.0  11.0  NaN

In [141]:
obj.rank()

d    1.0
a    2.0
b    3.0
c    4.0
dtype: float64

In [143]:
#値が出って来た順番の基づいてランクを決める
obj.rank(method='first')

d    1.0
a    2.0
b    3.0
c    4.0
dtype: float64

In [144]:
#降順
obj.rank(ascending=False,method='max')

d    4.0
a    3.0
b    2.0
c    1.0
dtype: float64

In [145]:
df1.rank(axis=1)

     a    b    c    d    f
0  1.0  2.0  3.0  5.0  4.0
1  2.0  3.0  4.0  5.0  1.0
2  1.0  2.0  3.0  4.0  NaN

In [146]:
df1.rank(axis=0)

     a    b    c    d    f
0  1.0  1.0  1.0  1.0  2.0
1  2.0  2.0  2.0  2.0  1.0
2  3.0  3.0  3.0  3.0  NaN

In [147]:
#重複タグをもつ軸のインデックス
obj= pd.Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [148]:
obj.index.is_unique

False

In [155]:
df = pd.DataFrame(np.arange(16.).reshape((4,4)),index=['a','a','c','d'])
df

      0     1     2     3
a   0.0   1.0   2.0   3.0
a   4.0   5.0   6.0   7.0
c   8.0   9.0  10.0  11.0
d  12.0  13.0  14.0  15.0

In [156]:
df.loc['a']

     0    1    2    3
a  0.0  1.0  2.0  3.0
a  4.0  5.0  6.0  7.0

# 5.3まとめおよび計算記述統計

In [157]:
df

      0     1     2     3
a   0.0   1.0   2.0   3.0
a   4.0   5.0   6.0   7.0
c   8.0   9.0  10.0  11.0
d  12.0  13.0  14.0  15.0

In [160]:
df.sum()

0    24.0
1    28.0
2    32.0
3    36.0
dtype: float64

In [161]:
df.sum(axis=1)

a     6.0
a    22.0
c    38.0
d    54.0
dtype: float64

In [163]:
df.idxmax()

0    d
1    d
2    d
3    d
dtype: object

In [164]:
df.cumsum()

      0     1     2     3
a   0.0   1.0   2.0   3.0
a   4.0   6.0   8.0  10.0
c  12.0  15.0  18.0  21.0
d  24.0  28.0  32.0  36.0

In [166]:
df.describe()

               0          1          2          3
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000